-series and data frames
-pandas and numpy
-data cleaning and wrangling 
-Eplioratory data analysis
-Data visualisation and pandas, matpolib and seaborn
-predictive modeling

In [5]:
a = [i for i in range(0, 100, 5)]
print(a)

[0, 5, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60, 65, 70, 75, 80, 85, 90, 95]

In [6]:
import pandas as pd
series = pd.Series(a)
print(series)

0      0
1      5
2     10
3     15
4     20
5     25
6     30
7     35
8     40
9     45
10    50
11    55
12    60
13    65
14    70
15    75
16    80
17    85
18    90
19    95
dtype: int64

In [7]:
type(series)

pandas.core.series.Series

In [9]:
a = [[i for i in range(10, 20, 2)], [i for i in range(20, 30, 2)]]
print(a)

[[10, 12, 14, 16, 18], [20, 22, 24, 26, 28]]

In [10]:
df = pd.DataFrame(a)
df

    0   1   2   3   4
0  10  12  14  16  18
1  20  22  24  26  28

In [11]:
data_t = df.T
data_t

    0   1
0  10  20
1  12  22
2  14  24
3  16  26
4  18  28

In [12]:
data_t.columns = ["age", "score"]
data_t

   age  score
0   10     20
1   12     22
2   14     24
3   16     26
4   18     28

In [13]:
data_t["Age"]

0    10
1    12
2    14
3    16
4    18
Name: age, dtype: int64

In [14]:
data_t["score"]

0    20
1    22
2    24
3    26
4    28
Name: score, dtype: int64

In [15]:
data_t["score"].values

array([20, 22, 24, 26, 28], dtype=int64)

In [16]:
###iloc
data_t.iloc[3].values

array([16, 26], dtype=int64)

In [18]:
case = []
for i in data_t.columns:
    b = i.upper()
    case.append(b)
case

['AGE', 'SCORE']

In [19]:
data_t.columns = case
data_t

   AGE  SCORE
0   10     20
1   12     22
2   14     24
3   16     26
4   18     28

In [20]:
#concat, merge, append

In [24]:
x = ["kate", "benny", "philo", "toby", "akunna"]
data_x = pd.DataFrame(x, columns=["NAMES"])
data_x

    NAMES
0    kate
1   benny
2   philo
3    toby
4  akunna

In [25]:
###you can only concat dataFrames of the same index together
c_data = pd.concat([data_t, data_x], axis = 1)
c_data

   AGE  SCORE   NAMES
0   10     20    kate
1   12     22   benny
2   14     24   philo
3   16     26    toby
4   18     28  akunna

In [30]:
dict_1 = {"sales_names": ["ben", "booth", "damian"], "sales_id": [1001, 1002, 1003]}
print(dict_1)

{'sales_names': ['ben', 'booth', 'damian'], 'sales_id': [1001, 1002, 1003]}

In [31]:
###example
for i in dict_1:
    print(i)

sales_names
sales_id

In [37]:
dict_2 = {"sales_id": [1003, 1001, 1002], "sales_location": [ "mile1", "agip", "rumuola"]}
print(dict_2)

{'sales_id': [1003, 1001, 1002], 'sales_location': ['mile1', 'agip', 'rumuola']}

In [38]:
df1 = pd.DataFrame(dict_1)
df1

  sales_names  sales_id
0         ben      1001
1       booth      1002
2      damian      1003

In [39]:
df2 = pd.DataFrame(dict_2)
df2

   sales_id sales_location
0      1003          mile1
1      1001           agip
2      1002        rumuola

In [40]:
df3 = pd.merge(df1, df2, on="sales_id")
df3

  sales_names  sales_id sales_location
0         ben      1001           agip
1       booth      1002        rumuola
2      damian      1003          mile1

In [42]:
y = [["sales_names", "sales_id", "sales_location"], ["jake", 1004, "gra"]]
data_y = pd.DataFrame(y[1:], columns =y[0])
data_y

  sales_names  sales_id sales_location
0        jake      1004            gra

In [44]:
df4 = df3.append(data_y)
df4

C:\Users\User\AppData\Local\Temp\ipykernel_956\3996139052.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df4 = df3.append(data_y)

  sales_names  sales_id sales_location
0         ben      1001           agip
1       booth      1002        rumuola
2      damian      1003          mile1
0        jake      1004            gra

In [46]:
k = df4.reset_index()
k

   index sales_names  sales_id sales_location
0      0         ben      1001           agip
1      1       booth      1002        rumuola
2      2      damian      1003          mile1
3      0        jake      1004            gra

In [47]:
df5 = k.drop("index", axis=1)
df5

  sales_names  sales_id sales_location
0         ben      1001           agip
1       booth      1002        rumuola
2      damian      1003          mile1
3        jake      1004            gra

In [48]:
df5.to_csv("sales.csv, index=False")